posts/2019-01-01-emacs-journey/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Journey 2018</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">My Emacs Journey 2018</h1>
</header><p>
I have started to use Emacs around the summer time after shelving the task of
getting started for several weeks. My intention was to find a cross-platform
editor which is not Electron-based (e.g. Atom or Visual Studio Code). The
thought of learning Emacs, an editor which is pretty much older than I am,
seemed intimidating at first, which was the major reason for putting it off for
so long. Now, at the start of the new year, I can look back and say, that the
invested time was well spent. I'd like to summarize a few concepts and tools
that I have learned along the way.
</p>

<div id="outline-container-the-right-tool-for-the-right-job" class="outline-2">
<h2 id="the-right-tool-for-the-right-job"><a href="#the-right-tool-for-the-right-job">The Right Tool for the Right Job</a></h2>
<div class="outline-text-2" id="text-the-right-tool-for-the-right-job">
<p>
I am still using other applications such as Notepad++ or Visual Studio and that
is fine. I don't feel the need to use Emacs as a hammer for every nail or screw
that I'll encounter.
</p>
</div>
</div>

<div id="outline-container-new-ways-of-thinking" class="outline-2">
<h2 id="new-ways-of-thinking"><a href="#new-ways-of-thinking">New Ways of Thinking</a></h2>
<div class="outline-text-2" id="text-new-ways-of-thinking">
<p>
Emacs is different than most editors or IDEs that I have used in the past.
Concepts such as buffer management, the "everything is text" philosophy or the
tinkering aspects were rather new to me. It took me a few days to internalize
the common vocabulary (e.g. <code>M-x foobar</code>, minibuffer, killing and yanking or
well known package names), which made re-reading several resources pretty
important. The <a href="https://reddit.com/r/emacs">/r/emacs</a> subreddit has helped me a lot.
</p>

<p>
I intentionally decided to start with a plain vanilla version of GNU Emacs so
that I could start with the "original" way of how to use to editor. Pretty soon
some aspects started to itch, which is where I either had to learn the "intended
way" or I had to bring in some external packages (extensions).
</p>
</div>
</div>

<div id="outline-container-org-mode" class="outline-2">
<h2 id="org-mode"><a href="#org-mode">Org Mode</a></h2>
<div class="outline-text-2" id="text-org-mode">
<p>
Most of my personal or work related notes used to be written in Markdown. I have
since migrated a major chunk of my personal notes to org-mode. The hierarchical
and task-oriented nature of org-mode really appeals to me. I do not consider
myself a power user, because I am only using a few of org-mode's features, e.g.
I still prefer a traditional calendar, even if org-agenda has some appealing
features.
</p>
</div>
</div>

<div id="outline-container-magit" class="outline-2">
<h2 id="magit"><a href="#magit">Magit</a></h2>
<div class="outline-text-2" id="text-magit">
<p>
Magit was one of the reasons why I have decided to learn Emacs in the first
place. I still like to fire up the good old console to use the git CLI, but
because of its interactive nature, Magit has made the process of staging and
committing files fun.
</p>
</div>
</div>

<div id="outline-container-ivy-counsel-and-swiper" class="outline-2">
<h2 id="ivy-counsel-and-swiper"><a href="#ivy-counsel-and-swiper">Ivy, Counsel and Swiper</a></h2>
<div class="outline-text-2" id="text-ivy-counsel-and-swiper">
<p>
Emacs ships with ido, a completion framework that you can turn on to e.g. speed up
the process of finding files in the minibuffer. I did not enjoy the look and
feel of ido, which is why I turned to ivy. I have never tried helm (ivy and helm
seem to be the two "go-to" completion packages), which is why I can't give an
educated insight into their differences, but from what I have read, ivy seems to
be more "light weight" compared to helm.
</p>

<p>
IDEs do offer features such as finding and replacing text in different files,
but ivy offers these features in a way, that I have never seen before. I really
enjoy the quick feedback and interactive nature that ivy can pull off.
</p>
</div>
</div>

<div id="outline-container-elfeed" class="outline-2">
<h2 id="elfeed"><a href="#elfeed">Elfeed</a></h2>
<div class="outline-text-2" id="text-elfeed">
<p>
I have recently re-discovered RSS feeds for myself. Back in the day, I was a
heavy Google Reader user, but those days are long gone. Elfeed is a decent RSS
reader that I have started to enjoy. Based on some custom configuration from the
author himself, I have written my own elisp functions which integrate the
youtube-dl CLI to download podcasts and videos in my feed.
</p>
</div>
</div>

<div id="outline-container-further-improvements-and-closing-thoughts" class="outline-2">
<h2 id="further-improvements-and-closing-thoughts"><a href="#further-improvements-and-closing-thoughts">Further Improvements and Closing Thoughts</a></h2>
<div class="outline-text-2" id="text-further-improvements-and-closing-thoughts">
<p>
It might seem crazy that the process of learning and configuring Emacs is never
really "done", but most of the time it does not really feel like work.
</p>

<p>
Things that I might tinker on in the future include:
</p>

<ul class="org-ul">
<li>Window management</li>
<li>In-buffer navigation</li>
<li>Customizing the mode line</li>
<li>Creating a simple theme</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-01-01</p>
<footer>
<p>Copyright 2025, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
